RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
/*
出厂时仪表波特率是9600,可以自行设置
每台设备出厂时通迅地址都是0x00

A:单次读取设备数据(设备接收到此命令后,向主机发送1次数据后回到等待状态)
0x88+0xAE+设备地址+0x11  实例88AE0011

B:连续读取设备数据(设备接收到此命令后,将以每秒6组的速度向主机连续发送数据)
0x88+0xAE+设备地址+0x21

C:停止设备输出数据,此命令不管当前工作的是哪一台设备,都将停止输出
0x88+0xAE+任意字节+0x01

D:设备返回给主机(PC)数据格式
0xFA+0xFB+设备地址+数据字节0+数据字节1+数据字节2+数据字节3+校验字节
数据由4个字节组成(注意:靠左的是低字节和习惯上是反的),接收后需要转换成浮点数才能对应设备显示数据.校验字节是4个数据字节相加的结果(进位舍去)
*/
typedef struct miniMeterCoder {
	unsigned char packet[8];
	unsigned char index;
	unsigned char addr;
	float 				value;
}miniMeterCoder_t;

void miniMeterCoder_init(miniMeterCoder_t * coder)
{
	int i;
	for( i=0; i< sizeof(coder->packet); i++)
		coder->packet[i]=0;
	coder->index = 0;
	coder->addr = 0;
}

int miniMeterCoder_prase( miniMeterCoder_t * coder, unsigned char data )
{
	unsigned char crc;
	unsigned char *value ;
	
	if( coder->index == 0  && data != 0xFA ) return 0;
	if( coder->index == 1 && data != 0xFB ) { coder->index = 0; return 0; }
	if( coder->index == 2  && data != coder->addr ) { coder->index = 0; return 0; }
	
	coder->packet[ coder->index++ ] = data;
	
	if( coder->index < sizeof(coder->packet) ) return 0;
	
	//check crc
	coder->index = 0;
	crc = coder->packet[3]+coder->packet[4]+coder->packet[5]+coder->packet[6];
	if( crc == coder->packet[7] ) {
		//coder->value = *((float*) &coder->packet[3] );
		value = (unsigned char *)&coder->value;
		value[0] = coder->packet[6];
		value[1] = coder->packet[5];
		value[2] = coder->packet[4];
		value[3] = coder->packet[3];
		return 1;
	}
	
	return -1;
}



miniMeterCoder_t currentMeter;
volatile int meter_started = 0;

void miniMeter_init()
{
	miniMeterCoder_init( &currentMeter );
}


void miniMeter_clear()
{
	
	Uart_Clear_Rx(METER_UART);
	
}


void miniMeter_toggle()
{
	unsigned char packget[]={0x88,0xAE,0x00,0x11};
	
	Uart_Put(METER_UART, packget, sizeof( packget) );
}




void miniMeter_test_even()
{
	unsigned char packget[8];
	int i,count;
	char buffer[16] = {0};

	count = Uart_Get( METER_UART , packget, sizeof( packget ) );
	if( count == 0 ) return;
	
	for( i=0; i< count ; i++){
		if( 1 == miniMeterCoder_prase( &currentMeter , packget[i] ) ){
			sprintf(buffer,"%3.5fV",currentMeter.value);
			userStation_log(buffer);
			//_LOG( "%.5fV" , currentMeter.value);
		}
	}
}




int service_getCurrent( float *A)
{
	unsigned char data;
	int i,count,res;
	
	res = 0;

	for( i=0,count=10; i< count ; i++)
 {
		if( 1 == Uart_Get( METER_UART , &data, 1 ) ) 
		{
			res = miniMeterCoder_prase( &currentMeter , data );
			if( 1 == res )
		  {
				*A = currentMeter.value;
				break;
			}else if( -1 == res ){
				//error
				break;
			}else{
				//continue
			}
		}else{
			// no uart data , break;
			res = 0;
			break;
		}
	}
	return res;
}



int miniMeter_start()
{
	unsigned char packget[]={0x88,0xAE,0x00,0x21};
	float A;
	int retry = 5;
	
	
	if ( meter_started == 1 ) return 1;
	miniMeter_clear();
	
	while( 0 < retry-- ){
		Uart_Put(METER_UART, packget, sizeof( packget) );
		systick_delay_ms(300);
		if( 1 == service_getCurrent( &A) ){
			meter_started = 1;
			return 1;
		}
	}
	
	return 0;
}

void miniMeter_stop()
{
	unsigned char packget[]={0x88,0xAE,0x00,0x01};

	//return ;
	
	if ( meter_started == 0 ) return;
	meter_started = 0;
	//Uart_Put(METER_UART, packget, sizeof( packget) );
}


#endif




#if USING_VICTORMETER

Uart_t *victor8165Uart;

#define VICTOR8165_BUFFSIZE 32
volatile unsigned char victor8165_buf[VICTOR8165_BUFFSIZE];
volatile unsigned char victor8165_inited = 0;
systick_time_t victor8165_cmd_timer;

int victor8165_cmd( char * cmd  )
{
	int i,count,len;
	
	while( systick_check_timer( &victor8165_cmd_timer ) == 0 ){
		systick_delay_us(500);
	}
	Uart_Clear_Rx( victor8165Uart );
	//while( 1 == Uart_Get( victor8165Uart, &victor8165_buf[0] , 1) );
	
	i = strlen(cmd);
	Uart_Put_Sync( victor8165Uart, (unsigned char *)cmd, i );
	//_LOG("cmd:%s",cmd);
	
	//get result , 1000ms timeout;
	count = 0;
	len = 0;
	for( i=0; i< 500 ; i++ ){
		count = Uart_Get( victor8165Uart, &victor8165_buf[len] , VICTOR8165_BUFFSIZE - len -1);
		len += count;
		if( len > 0 && victor8165_buf[len-1]==0x0A ){
			//systick_delay_us(50000);
			victor8165_buf[len]= 0;
			systick_init_timer( &victor8165_cmd_timer , 10); // next cmd need to wait 50ms
			return len;
		}
		if( count > 0 ) i--;
		systick_delay_us( 1000 );
	}
	
	//Uart_Put( victor8165Uart, (unsigned char *)"\n", 1 );
	//systick_delay_us( 100000 );
	_LOG("cmd:%s  timeout\n",cmd);
	systick_init_timer( &victor8165_cmd_timer , 100); // next cmd need to wait 100ms
	
	return 0;
}

int victor8165_check(const char* cmd, const char *result)
{
	int len;
	int i;
	
	len = victor8165_cmd( (char*) cmd);
	if( len == strlen(result) && 0 == strncmp(result,(char*) victor8165_buf , len) ){
		return 1;
	}
	
	/*
	for( i=0; i< len; i++ ){
		
		if( result[i] != victor8165_buf[i] ){
			userStation_log( "x,");
			return 0;
		}else{
			userStation_log( "1,");
		}
	}
	
	return 1;
	*/
	
	userStation_log( "check :\n");
	userStation_log((char*)cmd);
	userStation_log((char*)victor8165_buf);
	return 0;
}


void victor8165_init()
{
	int retry,res;
	
	victor8165Uart = CURRENT_UART;
	systick_init_timer( &victor8165_cmd_timer , 10);
	
	//set DCI mode
	res = 0;
	for( retry = 0; retry < 2; retry++ ){
		victor8165_cmd( "ADC\n");
		if( 1 == victor8165_check( "FUNC1?\n", "ADC\n") ){
			res = 1;
			break;
		}
	}
	if( res ) {
		_LOG("victor8165_init: set DCI mode ok\n");
		userStation_log("init: DCI ok");
	}else{
		_LOG("victor8165_init: set DCI mode false\n");
		userStation_log("init: DCI false");
		return;
	}
	
	//set Rate
	res = 0;
	for( retry = 0; retry < 2; retry++ ){
		victor8165_cmd( "RATE M\n");
		if( 1 == victor8165_check( "RATE?\n", "M\n") ){
			res = 1;
			break;
		}
	}
	if( res ) {
		_LOG("victor8165_init: set Rate M mode ok\n");
		userStation_log("init: Rate ok");
	}else{
		_LOG("victor8165_init: set Rate M mode false\n");
		userStation_log("init: Rate false");
		return;
	}
	
	//set range AUTO
	res = 0;
	for( retry = 0; retry < 2; retry++ ){
		victor8165_cmd( "RANGE 5\n");
		if( 1 == victor8165_check( "RANGE1?\n", "6\n") ){
			res = 1;
			break;
		}
	}
	if( res ) {
		_LOG("victor8165_init: set AUTO mode ok\n");
		userStation_log("init: Auto ok");
	}else{
		_LOG("victor8165_init: set AUTO mode false\n");
		userStation_log("init: Auto false");
		return;
	}
	
	victor8165_inited = 1;
	
